#include "Student.h"
#include <string>

string name[20] {
	"Чебикін Ігор",
	"Александренко Злотодан",
	"Андрейчук Чеслав",
	"Житинський Любослав",
	"Маковійчук Йомер",
	"Козуб Велемир",
	"Череватенко Гордослав",
	"Безручко Юлій",
	"Канторович Щастибог",
	"Фастенко Колодар",

	"Ортинська Болеслава",
	"Дзиндра Мстислава",
	"Дегтяренко Щавелина",
	"Гвоздецька Рошель",
	"Колцуняк Йовілла",
	"Поривай Злата",
	"Сірко Хівря",
	"Поляк Жанна",
	"Чепелюк Фотина",
	"Лукань Глафира"
};

string group[14] {
	"ІК", "ІТ", "ФЛ", "КН", "АР", "БТ", "ВП", "ЕЕ", "ГД", "КІ", "КБ", "МТ", "ХТ", "АН" 
};

Student makeStudent() {
	Student s;
	
	s.setName(name[rand() % 20]);
	s.setGroup(group[rand() % 14] + '-' + to_string(1 + rand() % 4) + to_string(1 + rand() % 4));
	double r = 3 + (double)(rand()) / ((double)(RAND_MAX / 2));
	s.setAvgMark(round(r * 100.0) / 100.0);
	return s;
}